"""
Скрипт має зчитувати і аналізувати лог-файл, підраховуючи кількість записів для кожного рівня логування 
(INFO, ERROR, DEBUG, WARNING).
Реалізуйте функцію parse_log_line(line: str) -> dict для парсингу рядків логу.
Реалізуйте функцію load_logs(file_path: str) -> list для завантаження логів з файлу.
Реалізуйте функцію filter_logs_by_level(logs: list, level: str) -> list для фільтрації логів за рівнем.
Реалізуйте функцію count_logs_by_level(logs: list) -> dict для підрахунку записів за рівнем логування.
Результати мають бути представлені у вигляді таблиці з кількістю записів для кожного рівня. 
Для цього реалізуйте функцію display_log_counts(counts: dict), 
яка форматує та виводить результати. Вона приймає результати виконання функції count_logs_by_level.
"""

